Documents/фин_ВводЗначенийРасчетныхПоказателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>фин_ВводЗначенийРасчетныхПоказателей</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.фин_ЗначенияРасчетныхПоказателейЗаПериод</xr:Item>
				<xr:Item>InformationRegister.фин_ПериодическиеЗначенияРасчетныхПоказателей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодПланирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйПоказатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_РасчетныеПоказатели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьЗначенияДляФактическихДанных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗначенияПоказателей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.фин_СправочникиНоменклатурныхСписков</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проект</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.фин_СправочникПроектов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УправленческоеПодразделение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.фин_СправочникУправленческихПодразделений</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительныеРазрезы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.фин_КлассификаторНаборовДополнительныхРазрезов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разрез1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разрез10</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разрез2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разрез3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разрез4</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разрез5</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разрез6</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разрез7</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разрез8</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разрез9</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеСценарии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сценарий</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/фин_ВводЗначенийРасчетныхПоказателей/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// Заполнение


////////////////////////////////////////////////////////////////////////////////
// Проведение

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт
	
	ДополнительныеЗапросы = Новый Массив;
	ДополнительныеЗапросы.Добавить("ЗначенияПоказателей");
	
	ПараметрыПроведения = фин_УправлениеПроведениемДокументовСервер.ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ,,,,,,ДополнительныеЗапросы);
	
	Возврат ПараметрыПроведения;

КонецФункции 

Функция ТекстЗапросаЗначенияПоказателей(НомераТаблиц, ПараметрыПроведения, Реквизиты) Экспорт
	
	
	НомераТаблиц.Вставить("ТаблицаЗначенияПоказателей", НомераТаблиц.Количество());

	ТекстЗапроса="ВЫБРАТЬ
	             |	ТЧ.Ссылка.ПериодПланирования КАК Период,
	             |	ТЧ.Ссылка.ПериодПланирования КАК ПериодПланирования,
	             |	ТЧ.Ссылка.Сценарий КАК Сценарий,
	             |	ТЧ.Ссылка.Расчетныйпоказатель КАК РасчетныйПоказатель,
	             |	ТЧ.Значение,
	             |	ТЧ.Контрагент,
	             |	ТЧ.Номенклатура,
	             |	ТЧ.Проект,
	             |	ТЧ.УправленческоеПодразделение,
	             |	ТЧ.ДополнительныеРазрезы,
	             |	ТЧ.Разрез1,
	             |	ТЧ.Разрез10,
	             |	ТЧ.Разрез2,
	             |	ТЧ.Разрез3,
	             |	ТЧ.Разрез4,
	             |	ТЧ.Разрез5,
	             |	ТЧ.Разрез6,
	             |	ТЧ.Разрез7,
	             |	ТЧ.Разрез8,
	             |	ТЧ.Разрез9
	             |ИЗ
	             |	Документ.фин_ВводЗначенийРасчетныхПоказателей.ЗначенияПоказателей КАК ТЧ
	             |ГДЕ
	             |	ТЧ.Ссылка = &Ссылка
				 |
				 |ОБЪЕДИНИТЬ ВСЕ
				 |
				 |ВЫБРАТЬ
	             |	ТЧ.Ссылка.ПериодПланирования КАК Период,
	             |	ТЧ.Ссылка.ПериодПланирования КАК ПериодПланирования,
	             |	ЗНАЧЕНИЕ(Справочник."+фин_ОбщегоНазначенияВызовСервераПовтИсп.ПрефиксОбщихОбъектов()+"СценарииПланирования.ПустаяСсылка) КАК Сценарий,
	             |	ТЧ.Ссылка.Расчетныйпоказатель КАК РасчетныйПоказатель,
	             |	ТЧ.Значение,
	             |	ТЧ.Контрагент,
	             |	ТЧ.Номенклатура,
	             |	ТЧ.Проект,
	             |	ТЧ.УправленческоеПодразделение,
	             |	ТЧ.ДополнительныеРазрезы,
	             |	ТЧ.Разрез1,
	             |	ТЧ.Разрез10,
	             |	ТЧ.Разрез2,
	             |	ТЧ.Разрез3,
	             |	ТЧ.Разрез4,
	             |	ТЧ.Разрез5,
	             |	ТЧ.Разрез6,
	             |	ТЧ.Разрез7,
	             |	ТЧ.Разрез8,
	             |	ТЧ.Разрез9
	             |ИЗ
	             |	Документ.фин_ВводЗначенийРасчетныхПоказателей.ЗначенияПоказателей КАК ТЧ
	             |ГДЕ
	             |	ТЧ.Ссылка = &Ссылка И ТЧ.Ссылка.ИспользоватьЗначенияДляФактическихДанных
				 |
				 |ОБЪЕДИНИТЬ ВСЕ
				 |
				 |ВЫБРАТЬ
	             |	ТЧ.Ссылка.ПериодПланирования КАК Период,
	             |	ТЧ.Ссылка.ПериодПланирования КАК ПериодПланирования,
	             |	ДополнительныеСценарии.Сценарий КАК Сценарий,
	             |	ТЧ.Ссылка.Расчетныйпоказатель КАК РасчетныйПоказатель,
	             |	ТЧ.Значение,
	             |	ТЧ.Контрагент,
	             |	ТЧ.Номенклатура,
	             |	ТЧ.Проект,
	             |	ТЧ.УправленческоеПодразделение,
	             |	ТЧ.ДополнительныеРазрезы,
	             |	ТЧ.Разрез1,
	             |	ТЧ.Разрез10,
	             |	ТЧ.Разрез2,
	             |	ТЧ.Разрез3,
	             |	ТЧ.Разрез4,
	             |	ТЧ.Разрез5,
	             |	ТЧ.Разрез6,
	             |	ТЧ.Разрез7,
	             |	ТЧ.Разрез8,
	             |	ТЧ.Разрез9
	             |ИЗ
	             |	Документ.фин_ВводЗначенийРасчетныхПоказателей.ЗначенияПоказателей КАК ТЧ
				 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.фин_ВводЗначенийРасчетныхПоказателей.ДополнительныеСценарии КАК ДополнительныеСценарии
				 |			ПО ТЧ.Ссылка = ДополнительныеСценарии.Ссылка
	             |ГДЕ
	             |	ТЧ.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + фин_УправлениеПроведениемДокументовСервер.ТекстРазделителяЗапросовПакета();

	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Интерфейс для работы с подсистемой Печать.

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Подготовка табличных печатных документов.


////////////////////////////////////////////////////////////////////////////////
// Прочие служебные процедуры и функции


#КонецЕсли
